---
kind: method
id: M:Autodesk.Revit.DB.SelectionFilterElement.AddSet(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
source: html/c486928c-cb19-29ab-3046-552e81674ccd.htm
---
# Autodesk.Revit.DB.SelectionFilterElement.AddSet Method

Adds a set of ElementIds to the filter's set.

## Syntax (C#)
```csharp
public void AddSet(
	ICollection<ElementId> ids
)
```

## Parameters
- **ids** (`System.Collections.Generic.ICollection < ElementId >`) - The set of ElementIds to add.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null